app/controllers/references_controller.rb

SELECT "references".* FROM "references"
---
 def index
    @references = Reference.all

SELECT  "references".* FROM "references" WHERE "references"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @reference = Reference.find(params[:id])

SELECT  "references".* FROM "references" WHERE "references"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def edit
    @reference = Reference.find(params[:id])

SELECT  "references".* FROM "references" WHERE "references"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "references" SET "kind" = ?, "notes" = ?, "updated_at" = ? WHERE "references"."id" = ?  [["kind", "Book"], ["notes", ""], ["updated_at", 2016-11-03 11:23:05 UTC], ["id", 1]]
---
  def update
    @reference = Reference.find(params[:id])
    if @reference.update(reference_params)

INSERT INTO "references" ("number", "kind", "title", "author", "created_at", "updated_at", "userid") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", "56765"], ["kind", "jhsfgkjhg"], ["title", "jhg"], ["author", "kjhg"], ["created_at", 2016-11-02 18:43:46 UTC], ["updated_at", 2016-11-02 18:43:46 UTC], ["userid", "45"]]
---
  def create
      @reference = Reference.new(reference_params)
      if @reference.save

SELECT  "references".* FROM "references" WHERE "references"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "references" WHERE "references"."id" = ?  [["id", 12]]
---
   def destroy
    @reference = Reference.find(params[:id])
    @reference.destroy